http://www.madopro.net/entry/2016/10/14/022723

In [5]:
import pandas as pd
import numpy as np

In [15]:
# 10月7日の終値のSeriesを作る

# 配列から
s = pd.Series([16860.089844, 2153.73999, 10490.860352], index=['N225', 'GSPC', 'GDAXI'])
s

N225     16860.089844
GSPC      2153.739990
GDAXI    10490.860352
dtype: float64

In [16]:
# 辞書から
s = pd.Series({'N225':16860.089844 , 'GSPC':2153.73999 , 'GDAXI':10490.860352 })
s

GDAXI    10490.860352
GSPC      2153.739990
N225     16860.089844
dtype: float64

In [36]:
# Seriesの辞書から
df = pd.DataFrame({
        'open': pd.Series([16883.119141, 2164.189941, 10549.69043], index=['N225', 'GSPC', 'GDAXI']),
        'close': pd.Series([16860.089844, 2153.73999, 10490.860352], index=['N225', 'GSPC', 'GDAXI'])
    })
df

              close          open
N225   16860.089844  16883.119141
GSPC    2153.739990   2164.189941
GDAXI  10490.860352  10549.690430

In [19]:
# 配列の辞書から
df = pd.DataFrame({
        'open': [16883.119141, 2164.189941, 10549.69043],
        'close': [16860.089844, 2153.73999, 10490.860352]
    }, index=['N225', 'GSPC', 'GDAXI'])
df

              close          open
N225   16860.089844  16883.119141
GSPC    2153.739990   2164.189941
GDAXI  10490.860352  10549.690430

In [29]:
print(df['close'], '\n')
print(df.close, '\n')

N225     16860.089844
GSPC      2153.739990
GDAXI    10490.860352
Name: close, dtype: float64

N225     16860.089844
GSPC      2153.739990
GDAXI    10490.860352
Name: close, dtype: float64

In [38]:
print(df.loc['N225'], '\n')
print(df.iloc[0], '\n')
print(df.iloc[0:2], '\n')
print(df.iloc[[True, True, False]], '\n')

close    16860.089844
open     16883.119141
Name: N225, dtype: float64

close    16860.089844
open     16883.119141
Name: N225, dtype: float64

             close          open
N225  16860.089844  16883.119141
GSPC   2153.739990   2164.189941

             close          open
N225  16860.089844  16883.119141
GSPC   2153.739990   2164.189941

http://cocodrips.hateblo.jp/entry/2017/07/30/185430

In [1]:
import pandas as pd

titanic_df = pd.read_csv("sample.csv")
titanic_df.head()

   Survived  Pclass     Sex   Age    Fare Embarked
0         1       1    male  80.0  30.000        S
1         1       2  female   4.0  39.000        S
2         0       2  female  24.0  13.000        S
3         0       2    male  37.0  26.000        S
4         0       3  female  11.0  31.275        S

In [3]:
titanic_df.shape

(7, 6)

In [4]:
titanic_df.describe()

       Survived    Pclass        Age       Fare
count  7.000000  7.000000   7.000000   7.000000
mean   0.428571  2.285714  27.285714  21.964886
std    0.534522  0.755929  25.571562  12.726325
min    0.000000  1.000000   4.000000   7.229200
25%    0.000000  2.000000  12.000000  10.125000
50%    0.000000  2.000000  22.000000  26.000000
75%    1.000000  3.000000  30.500000  30.637500
max    1.000000  3.000000  80.000000  39.000000

In [15]:
titanic_df.iloc[[0],[0,1]]

   Survived  Pclass
0         1       1

In [19]:
titanic_df[titanic_df["Age"] > 20]

   Survived  Pclass     Sex   Age   Fare Embarked
0         1       1    male  80.0  30.00        S
2         0       2  female  24.0  13.00        S
3         0       2    male  37.0  26.00        S
6         0       3    male  22.0   7.25        S

In [22]:
titanic_df.query("Age > 20")

   Survived  Pclass     Sex   Age   Fare Embarked
0         1       1    male  80.0  30.00        S
2         0       2  female  24.0  13.00        S
3         0       2    male  37.0  26.00        S
6         0       3    male  22.0   7.25        S

In [23]:
titanic_df.assign(One=1)

   Survived  Pclass     Sex   Age     Fare Embarked  One
0         1       1    male  80.0  30.0000        S    1
1         1       2  female   4.0  39.0000        S    1
2         0       2  female  24.0  13.0000        S    1
3         0       2    male  37.0  26.0000        S    1
4         0       3  female  11.0  31.2750        S    1
5         1       3  female  13.0   7.2292        C    1
6         0       3    male  22.0   7.2500        S    1

In [24]:
titanic_df

   Survived  Pclass     Sex   Age     Fare Embarked
0         1       1    male  80.0  30.0000        S
1         1       2  female   4.0  39.0000        S
2         0       2  female  24.0  13.0000        S
3         0       2    male  37.0  26.0000        S
4         0       3  female  11.0  31.2750        S
5         1       3  female  13.0   7.2292        C
6         0       3    male  22.0   7.2500        S

In [25]:
titanic_df.assign(IsChild = titanic_df["Age"] < 20)

   Survived  Pclass     Sex   Age     Fare Embarked  IsChild
0         1       1    male  80.0  30.0000        S    False
1         1       2  female   4.0  39.0000        S     True
2         0       2  female  24.0  13.0000        S    False
3         0       2    male  37.0  26.0000        S    False
4         0       3  female  11.0  31.2750        S     True
5         1       3  female  13.0   7.2292        C     True
6         0       3    male  22.0   7.2500        S    False

In [26]:
titanic_df

   Survived  Pclass     Sex   Age     Fare Embarked
0         1       1    male  80.0  30.0000        S
1         1       2  female   4.0  39.0000        S
2         0       2  female  24.0  13.0000        S
3         0       2    male  37.0  26.0000        S
4         0       3  female  11.0  31.2750        S
5         1       3  female  13.0   7.2292        C
6         0       3    male  22.0   7.2500        S

In [28]:
titanic_df['IsChild'] = (titanic_df['Age'] < 20).astype(int)

In [29]:
titanic_df

   Survived  Pclass     Sex   Age     Fare Embarked  IsChild
0         1       1    male  80.0  30.0000        S        0
1         1       2  female   4.0  39.0000        S        1
2         0       2  female  24.0  13.0000        S        0
3         0       2    male  37.0  26.0000        S        0
4         0       3  female  11.0  31.2750        S        1
5         1       3  female  13.0   7.2292        C        1
6         0       3    male  22.0   7.2500        S        0